app/controllers/comments_controller.rb

 def create
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.create(params[:comment].permit(:commenter, :body))
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "topic_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test"], ["commenter", "kk"], ["created_at", Mon, 10 Mar 2014 20:48:11 UTC +00:00], ["topic_id", 1], ["updated_at", Mon, 10 Mar 2014 20:48:11 UTC +00:00]]

def destroy
    @topic = Topic.find(params[:topic_id])
    @comment = @topic.comments.find(params[:id])
    @comment.destroy
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."topic_id" = ? AND "comments"."id" = ? LIMIT 1  [["topic_id", 1], ["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]