app/controllers/votes_controller.rb

  def create
    topic = Topic.find (params[:topic_id])
    vote = topic.votes.build
    vote.save!
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 10 Mar 2014 20:02:39 UTC +00:00], ["topic_id", 1], ["updated_at", Mon, 10 Mar 2014 20:02:39 UTC +00:00]]